Revit 2024 API
AnalysisDisplayMarkersAndTextSettings Constructor (AnalysisDisplayMarkersAndTextSettings)
 Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings other
)
Visual Basic
Public Sub New ( _
	other As AnalysisDisplayMarkersAndTextSettings _
)
Visual C++
public:
AnalysisDisplayMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisDisplayMarkersAndTextSettings Class
AnalysisDisplayMarkersAndTextSettings Overload
Autodesk.Revit.DB.Analysis Namespace